In [1]:
import pandas as pd

In [2]:
employee_2challenge = pd.read_csv('employee_data.csv')

In [3]:
employee_2challenge.head()

  First Name Surname Department  Salary
0   Isabella  Garcia  Marketing  108268
1      David  Garcia  Marketing   83567
2   Isabella   Smith  Marketing   82613
3       Jane   Jones         HR   85891
4       Emma  Wilson    Finance   61243

In [4]:
employee_2challenge.tail()

    First Name   Surname   Department  Salary
595    Matthew     Brown    Marketing   77292
596    Michael  Williams  Engineering  139131
597       Jane     Smith  Engineering  115577
598       John     Brown    Marketing   95986
599    Matthew  Williams    Marketing   50413

In [5]:
employee_2challenge.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 600 entries, 0 to 599
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   First Name  600 non-null    object
 1   Surname     600 non-null    object
 2   Department  600 non-null    object
 3   Salary      600 non-null    int64
dtypes: int64(1), object(3)
memory usage: 18.9+ KB

# 11. Add 10% bonus to employee salary and create a column called Employee Bonus

In [8]:
employee_2challenge['Employee_bonus'] = employee_2challenge['Salary'] * 0.1

In [9]:
employee_2challenge.head()

  First Name Surname Department  Salary  Employee_bonus
0   Isabella  Garcia  Marketing  108268         10826.8
1      David  Garcia  Marketing   83567          8356.7
2   Isabella   Smith  Marketing   82613          8261.3
3       Jane   Jones         HR   85891          8589.1
4       Emma  Wilson    Finance   61243          6124.3

# 12. What is the total compensation (salary + bonus) for each employee

In [11]:
employee_2challenge['Total_Compesation'] = employee_2challenge['Salary'] +  employee_2challenge['Employee_bonus']

In [13]:
employee_2challenge.head()

  First Name Surname Department  Salary  Employee_bonus  Total_Compesation
0   Isabella  Garcia  Marketing  108268         10826.8           119094.8
1      David  Garcia  Marketing   83567          8356.7            91923.7
2   Isabella   Smith  Marketing   82613          8261.3            90874.3
3       Jane   Jones         HR   85891          8589.1            94480.1
4       Emma  Wilson    Finance   61243          6124.3            67367.3

In [15]:
employee_2challenge.to_csv('Classwork_Pandas_Part2')